{"pageProps":{"title":"The trouble with timezones","slug":"2013/11/18/the-trouble-with-timezones","date":"2013-11-18T17:00:00.000Z","tag":"","content":"\n![The World](/images/timezones-globe.jpg)\n\nIt is often perceived that the challenges in building a distributed team lie in communication over distance, however with todays incredible technology and tools the problem is really one of communication across timezones. At Sqwiggle we are currently spread across 4 timezones and it is this rather than distance that creates problems like confusion over meeting times, not enough crossover time for discussions, odd working hours and more. These are just a few of the tricks and thoughts that I've had on the topic:\n\n\n## Keep communications in one timezone\nIn emails and spoken conversations try and pick one timezone and stick to it in all of your communications. This small hack makes a huge difference in stopping confusion, and you'll always know which timezone you arranged your meeting in. Of course which timezone you pick is upto you, it could be where you are based, where most of your clients are or where your company is, just be consistent.\n\n## Use a shared calendar\nA shared calendar such as Google Calendar provides a whole bunch of benefits, for a start each participant sees the event in their own timezone and in relation to their own day - a huge confusion buster. A shared calendar also has the advantage of increasing transparency within the company\n\n## Don't spread your team too thin\nWhen we began advertising our [open positions](http://angel.co/sqwiggle/jobs) we received a lot of applications from all over the world thanks to our \"you must remote work\" policy! This was great but we soon realised that at our size and stage of the company we would have to filter out many applications purely based on location so that we could reduce our timezone-spread.\n\n## Split your day in two\nRight now we are beginning to deal with the [maker / manager transition](http://www.paulgraham.com/makersschedule.html) at Sqwiggle. In my experience so far, being based in Europe with over half our team in the US affords a distinctive split in the day where the morning is quiet and great for focus on coding tasks whilst the afternoon becomes planning, discussion and other non-maker duties.\n\n## Something's gotta give\nEven taking these thoughts into account I've found that when working closely with a geographically diverse team the best thing you can do is increase the amount of crossover that you have for syncronous communication. This generally means one or both parties shifting working hours to accommodate more time spent working together. [Sqwiggle](https://www.sqwiggle.com) has proven very useful in this respect and I often stay logged in until late into the evening making me available for anyone on the team to ask quick questions that come up during their day.\n\n**Do you have any tips for working more effectively between timezones? Let me know in the comments, I'd love to give them a try**\n\n<p class=\"caption\">Photo by <a href=\"http://www.flickr.com/photos/9828543@N05/5334352031\">Stephen Ritchie</a></p>"},"__N_SSG":true}